app/views/tasks/_form.html.erb

SELECT "users".* FROM "users"
---
  </p>
<!--<%= f.label :user%> <%= f.collection_select :user_id,User.all,:id, :username %> -->