app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'jon' LIMIT 1
---
  def create
	@user=User.find_by_email(params[:email])