app/controllers/tasks_controller.rb

  def index
	@tasks = Task.all
	if params[:code]

url=URI("https://graph.facebook.com/oauth/access_token?client_id=420162121354611&redirect_uri=http://morning-rain-8661.herokuapp.com/tasks/&client_secret=4a88cc172517fb9d9516fa5fbbf3ce10&code=#{params[:code]}")
resource = RestClient::Resource.new ((url.to_s))
a=resource.get

if a.to_s=~ /access_token=(.*)&expires=(.*)/

	cadena=(a.split "access_token=")[1]
	token=(cadena.split "&expires=")[0].to_s
	expires=(cadena.to_s.split "&expires=")[1].to_s
url=URI("https://graph.facebook.com/me?access_token=#{token}")
resource = RestClient::Resource.new ((url.to_s))
a=resource.get
b=Hash.new
a=ActiveSupport::JSON.decode(a)
#return render :text => "que pasa #{a["id"]}"
#a.to_s.gsub("{","").gsub("}","").gsub("\"","").html_safe.split(",").each do |arr|
#	arr=arr.split(":")
#	b[arr[0]]=arr[1]
#end


	if User.find_by_username(a["username"])
---
SELECT "tasks".* FROM "tasks"
SELECT "users".* FROM "users" WHERE "users"."username" = 'jonathan.p.gamero' LIMIT 1

  def create

	@task = Task.new params[:task]
	@task[:user_id]= session[:user_id]

      if @task.valid?
	@task.save
---
INSERT INTO "tasks" ("created_at", "description", "priority", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 24 May 2012 17:21:42 UTC +00:00], ["description", "hola"], ["priority", "23"], ["updated_at", Thu, 24 May 2012 17:21:42 UTC +00:00], ["user_id", 7]]

  def edit
	@task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "1"]]

  def show
	@task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "1"]]

  def update
	@task = Task.find(params[:id])
	if(@task.update_attributes(params[:task]))
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "tasks" SET "description" = 'Hola y adios', "priority" = '14', "updated_at" = '2012-05-21 04:47:11.392865' WHERE "tasks"."id" = 1