app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show


    if request.session_options[:id]==params[:id]
@user = User.find(params[:id])

INSERT INTO "users" ("created_at", "email", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", Mon, 21 May 2012 17:16:48 UTC +00:00], ["email", "jonathan"], ["updated_at", Mon, 21 May 2012 17:16:48 UTC +00:00], ["username", "hola"]]
---
  def create
    @user = User.new(params[:user])
return render :text => params[:user]
    respond_to do |format|
      if @user.save